---
title: Mirror
classe: Autodesk.Revit.DB.Visual.Mirror
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# Mirror

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String CommonTintColor { get; }` | `Mirror.CommonTintColor` | String |
| `String CommonTintToggle { get; }` | `Mirror.CommonTintToggle` | String |
| `String MirrorColorByObject { get; }` | `Mirror.MirrorColorByObject` | String |
| `String MirrorTintcolor { get; }` | `Mirror.MirrorTintcolor` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```